{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [5, 5], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [1, 1], "filters": 30, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 1, 128, 128], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_1", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 26, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2"}}], "backend": "tensorflow", "keras_version": "2.0.4"}